<!-- Projeto Desenvolvido na Data Science Academy - www.datascienceacademy.com.br -->
# <font color='blue'>Data Science Academy</font>
## <font color='blue'>Automação de Processos e Engenharia de Dados com Python, Excel e IA</font>
## <font color='blue'>Exercícios</font>

## Pacotes Python Usados no Projeto

In [1]:
# Instala o pacote watermark
!pip install -q -U watermark

In [2]:
# Imports
import pandas as pd

In [3]:
%reload_ext watermark
%watermark -a "Data Science Academy"

Author: Data Science Academy

Neste exercício você vai praticar suas habilidades de pesquisa e estudar a função pivot.

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.pivot.html

Então considere o dataframe abaixo e crie o código Python que gera as 5 tabelas pivot a seguir. Compare suas respostas com o gabarito fornecido.

In [4]:
# Dataframe
df = pd.DataFrame({
    'Montadora': ['Porsche', 'Honda', 'Toyota', 'BMW', 'Porsche', 'Honda', 'Toyota', 'BMW'],
    'Localidade': ['EUA', 'EUA', 'EUA', 'EUA', 'Alemanha', 'Alemanha', 'Alemanha', 'Alemanha'],
    'Modelo':['Taycan', 'Civic', 'Corolla', 'Z4', 'Macan', 'Accord', 'Camry', 'X3'],
    'Unidades_Vendidas': [97, 75, 84, 92, 120, 98, 76, 81]})

In [5]:
df

  Montadora Localidade   Modelo  Unidades_Vendidas
0   Porsche        EUA   Taycan                 97
1     Honda        EUA    Civic                 75
2    Toyota        EUA  Corolla                 84
3       BMW        EUA       Z4                 92
4   Porsche   Alemanha    Macan                120
5     Honda   Alemanha   Accord                 98
6    Toyota   Alemanha    Camry                 76
7       BMW   Alemanha       X3                 81

In [6]:
# Tabela Pivot 1
pd.pivot(data = df, 
         index = 'Montadora', 
         columns = 'Localidade', 
         values = ['Unidades_Vendidas']).fillna(0)

           Unidades_Vendidas
Localidade          Alemanha EUA
Montadora
BMW                       81  92
Honda                     98  75
Porsche                  120  97
Toyota                    76  84

In [7]:
# Tabela Pivot 2
df.pivot(columns = 'Localidade', 
         values = ['Modelo', 'Unidades_Vendidas'], 
         index = 'Montadora')

             Modelo          Unidades_Vendidas
Localidade Alemanha      EUA          Alemanha EUA
Montadora
BMW              X3       Z4                81  92
Honda        Accord    Civic                98  75
Porsche       Macan   Taycan               120  97
Toyota        Camry  Corolla                76  84

In [8]:
# Tabela Pivot 3
df.pivot(columns = 'Localidade', 
         values = ['Modelo'], 
         index = 'Montadora')

             Modelo
Localidade Alemanha      EUA
Montadora
BMW              X3       Z4
Honda        Accord    Civic
Porsche       Macan   Taycan
Toyota        Camry  Corolla

In [9]:
# Tabela Pivot 4
df.pivot_table(index = 'Montadora', 
               columns = 'Localidade', 
               values = ['Modelo', 'Unidades_Vendidas'],
               aggfunc = {'Modelo':'count', 'Unidades_Vendidas':'mean'})

             Modelo     Unidades_Vendidas
Localidade Alemanha EUA          Alemanha   EUA
Montadora
BMW               1   1              81.0  92.0
Honda             1   1              98.0  75.0
Porsche           1   1             120.0  97.0
Toyota            1   1              76.0  84.0

In [10]:
# Tabela Pivot 5
df.pivot_table(index = ['Montadora', 'Modelo'], 
               columns = 'Localidade', 
               values = ['Unidades_Vendidas'],
               aggfunc = {'Unidades_Vendidas':'mean'}).fillna(0)

                  Unidades_Vendidas
Localidade                 Alemanha   EUA
Montadora Modelo
BMW       X3                   81.0   0.0
          Z4                    0.0  92.0
Honda     Accord               98.0   0.0
          Civic                 0.0  75.0
Porsche   Macan               120.0   0.0
          Taycan                0.0  97.0
Toyota    Camry                76.0   0.0
          Corolla               0.0  84.0

In [11]:
%reload_ext watermark
%watermark -a "Data Science Academy"

Author: Data Science Academy

In [12]:
#%watermark

In [13]:
#%watermark --iversions

# Fim